constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    frontAndback
    {
        type            empty;
        physicalType    empty;
        nFaces          14016;
        startFace       10413;
    }
    top
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       24429;
    }
    inlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       24489;
    }
    bottom
    {
        type            patch;
        physicalType    patch;
        nFaces          60;
        startFace       24519;
    }
    outlet
    {
        type            patch;
        physicalType    patch;
        nFaces          30;
        startFace       24579;
    }
    cylinderWalls
    {
        type            patch;
        physicalType    patch;
        nFaces          18;
        startFace       24609;
    }
)

// ************************************************************************* //
