constant/dropletProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dropletProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

originalDropletSize             [0 1 0 0 0 0 0] 0.001735;
assimilationActivation			false;
interface 						"cylinderWalls";
assimilationDataType			"dropletSize";
initialBNumber					0.335;

// ************************************************************************* //
