0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.00 0.0 0);


boundaryField
{
    frontAndback
    {
        type            empty;
    }
    inlet
    {
		type          	pressureNormalInletOutletVelocity;
		value 			uniform (0 0 0);
    }
    top
    {
		type          	pressureNormalInletOutletVelocity;
		value 			uniform (0 0 0);
    }
    bottom
    {
		type          	pressureNormalInletOutletVelocity;
		value 			uniform (0 0 0);
    }    
    cylinderWalls
    {
        type            surfaceNormalFixedValue;
        refValue        uniform -0.1;
    }
    outlet
    {
        type            flowRateInletVelocity;
        massFlowRate    -0.0004;
        value           $internalField;
    }
}

// ************************************************************************* //
